{"modelTopology": {"node": [{"name": "Min/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv4/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "decoder/conv3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "decoder/conv3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}}}, {"name": "concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "conv5/conv5_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "conv4/conv4_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}}}, {"name": "conv3/conv3_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2/conv2_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2/conv2_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "conv2/conv2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2/conv2_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape/_0__cf__51", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "conv5/conv5_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/strided_slice_1/_10__cf__61", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/strided_slice_2/_11__cf__62", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/strided_slice_2/_7__cf__58", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/strided_slice_2/_3__cf__54", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub", "op": "Sub", "input": ["input", "Reshape/_0__cf__51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_1/Conv2D", "op": "Conv2D", "input": ["sub", "conv1/conv1_1/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv1/conv1_1/BiasAdd", "op": "BiasAdd", "input": ["conv1/conv1_1/Conv2D", "conv1/conv1_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv1/conv1_1/Relu", "op": "Relu", "input": ["conv1/conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv1/conv1_2/Conv2D", "op": "Conv2D", "input": ["conv1/conv1_1/Relu", "conv1/conv1_2/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv1/conv1_2/BiasAdd", "op": "BiasAdd", "input": ["conv1/conv1_2/Conv2D", "conv1/conv1_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv1/conv1_2/Relu", "op": "Relu", "input": ["conv1/conv1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d/MaxPool", "op": "MaxPool", "input": ["conv1/conv1_2/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2/conv2_1/Conv2D", "op": "Conv2D", "input": ["max_pooling2d/MaxPool", "conv2/conv2_1/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2/conv2_1/BiasAdd", "op": "BiasAdd", "input": ["conv2/conv2_1/Conv2D", "conv2/conv2_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2/conv2_1/Relu", "op": "Relu", "input": ["conv2/conv2_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2/conv2_2/Conv2D", "op": "Conv2D", "input": ["conv2/conv2_1/Relu", "conv2/conv2_2/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv2/conv2_2/BiasAdd", "op": "BiasAdd", "input": ["conv2/conv2_2/Conv2D", "conv2/conv2_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2/conv2_2/Relu", "op": "Relu", "input": ["conv2/conv2_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["conv2/conv2_2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv3/conv3_1/Conv2D", "op": "Conv2D", "input": ["max_pooling2d_1/MaxPool", "conv3/conv3_1/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv3/conv3_1/BiasAdd", "op": "BiasAdd", "input": ["conv3/conv3_1/Conv2D", "conv3/conv3_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv3/conv3_1/Relu", "op": "Relu", "input": ["conv3/conv3_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_2/Conv2D", "op": "Conv2D", "input": ["conv3/conv3_1/Relu", "conv3/conv3_2/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv3/conv3_2/BiasAdd", "op": "BiasAdd", "input": ["conv3/conv3_2/Conv2D", "conv3/conv3_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_2/Relu", "op": "Relu", "input": ["conv3/conv3_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv3/conv3_3/Conv2D", "op": "Conv2D", "input": ["conv3/conv3_2/Relu", "conv3/conv3_3/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "conv3/conv3_3/BiasAdd", "op": "BiasAdd", "input": ["conv3/conv3_3/Conv2D", "conv3/conv3_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv3/conv3_3/Relu", "op": "Relu", "input": ["conv3/conv3_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["conv3/conv3_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "conv4/conv4_1/Conv2D", "op": "Conv2D", "input": ["max_pooling2d_2/MaxPool", "conv4/conv4_1/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv4/conv4_1/BiasAdd", "op": "BiasAdd", "input": ["conv4/conv4_1/Conv2D", "conv4/conv4_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv4/conv4_1/Relu", "op": "Relu", "input": ["conv4/conv4_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_2/Conv2D", "op": "Conv2D", "input": ["conv4/conv4_1/Relu", "conv4/conv4_2/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv4/conv4_2/BiasAdd", "op": "BiasAdd", "input": ["conv4/conv4_2/Conv2D", "conv4/conv4_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv4/conv4_2/Relu", "op": "Relu", "input": ["conv4/conv4_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv4/conv4_3/Conv2D", "op": "Conv2D", "input": ["conv4/conv4_2/Relu", "conv4/conv4_3/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv4/conv4_3/BiasAdd", "op": "BiasAdd", "input": ["conv4/conv4_3/Conv2D", "conv4/conv4_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv4/conv4_3/Relu", "op": "Relu", "input": ["conv4/conv4_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["conv4/conv4_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv5/conv5_1/Shape", "op": "Shape", "input": ["max_pooling2d_3/MaxPool"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_1/strided_slice_1", "op": "StridedSlice", "input": ["conv5/conv5_1/Shape", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice_1/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "conv5/conv5_1/strided_slice", "op": "StridedSlice", "input": ["conv5/conv5_1/Shape", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "conv5/conv5_1/stack_1", "op": "Pack", "input": ["conv5/conv5_1/strided_slice", "conv5/conv5_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53", "conv5/conv5_1/stack_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["conv5/conv5_1/required_space_to_batch_paddings/add_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_1/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["conv5/conv5_1/required_space_to_batch_paddings/sub", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_7", "op": "StridedSlice", "input": ["conv5/conv5_1/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_6", "op": "StridedSlice", "input": ["conv5/conv5_1/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/add_2", "op": "Add", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_1/required_space_to_batch_paddings/mod_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/crops/1", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_7"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/crops/0", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_6"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_5", "op": "StridedSlice", "input": ["conv5/conv5_1/required_space_to_batch_paddings/add_2", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_3", "op": "StridedSlice", "input": ["conv5/conv5_1/required_space_to_batch_paddings/add_2", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/crops", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0", "conv5/conv5_1/required_space_to_batch_paddings/crops/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/paddings/1", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_5"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/paddings/0", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv5/conv5_1/required_space_to_batch_paddings/paddings", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/paddings/0", "conv5/conv5_1/required_space_to_batch_paddings/paddings/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_1/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["max_pooling2d_3/MaxPool", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_1/required_space_to_batch_paddings/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_1/Conv2D", "op": "Conv2D", "input": ["conv5/conv5_1/SpaceToBatchND", "conv5/conv5_1/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv5/conv5_1/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["conv5/conv5_1/Conv2D", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_1/required_space_to_batch_paddings/crops"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_1/BiasAdd", "op": "BiasAdd", "input": ["conv5/conv5_1/BatchToSpaceND", "conv5/conv5_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv5/conv5_1/Relu", "op": "Relu", "input": ["conv5/conv5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_2/Shape", "op": "Shape", "input": ["conv5/conv5_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/strided_slice_1", "op": "StridedSlice", "input": ["conv5/conv5_2/Shape", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice_1/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/strided_slice", "op": "StridedSlice", "input": ["conv5/conv5_2/Shape", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/stack_1", "op": "Pack", "input": ["conv5/conv5_2/strided_slice", "conv5/conv5_2/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53", "conv5/conv5_2/stack_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["conv5/conv5_2/required_space_to_batch_paddings/add_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_2/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["conv5/conv5_2/required_space_to_batch_paddings/sub", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_7", "op": "StridedSlice", "input": ["conv5/conv5_2/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_6", "op": "StridedSlice", "input": ["conv5/conv5_2/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/add_2", "op": "Add", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_2/required_space_to_batch_paddings/mod_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/crops/1", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_7"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/crops/0", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_6"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_5", "op": "StridedSlice", "input": ["conv5/conv5_2/required_space_to_batch_paddings/add_2", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_3", "op": "StridedSlice", "input": ["conv5/conv5_2/required_space_to_batch_paddings/add_2", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/crops", "op": "Pack", "input": ["conv5/conv5_2/required_space_to_batch_paddings/crops/0", "conv5/conv5_2/required_space_to_batch_paddings/crops/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/paddings/1", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_5"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/paddings/0", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_2/required_space_to_batch_paddings/strided_slice_3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_2/required_space_to_batch_paddings/paddings", "op": "Pack", "input": ["conv5/conv5_2/required_space_to_batch_paddings/paddings/0", "conv5/conv5_2/required_space_to_batch_paddings/paddings/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv5/conv5_2/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["conv5/conv5_1/Relu", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_2/required_space_to_batch_paddings/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_2/Conv2D", "op": "Conv2D", "input": ["conv5/conv5_2/SpaceToBatchND", "conv5/conv5_2/kernel"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_2/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["conv5/conv5_2/Conv2D", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_2/required_space_to_batch_paddings/crops"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_2/BiasAdd", "op": "BiasAdd", "input": ["conv5/conv5_2/BatchToSpaceND", "conv5/conv5_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_2/Relu", "op": "Relu", "input": ["conv5/conv5_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_3/Shape", "op": "Shape", "input": ["conv5/conv5_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/strided_slice_1", "op": "StridedSlice", "input": ["conv5/conv5_3/Shape", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice_1/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "conv5/conv5_3/strided_slice", "op": "StridedSlice", "input": ["conv5/conv5_3/Shape", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "conv5/conv5_3/stack_1", "op": "Pack", "input": ["conv5/conv5_3/strided_slice", "conv5/conv5_3/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53", "conv5/conv5_3/stack_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["conv5/conv5_3/required_space_to_batch_paddings/add_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_3/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["conv5/conv5_3/required_space_to_batch_paddings/sub", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_7", "op": "StridedSlice", "input": ["conv5/conv5_3/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_6", "op": "StridedSlice", "input": ["conv5/conv5_3/required_space_to_batch_paddings/mod_1", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/add_2", "op": "Add", "input": ["conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_3/required_space_to_batch_paddings/mod_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/crops/1", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_7"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/crops/0", "op": "Pack", "input": ["conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_6"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_5", "op": "StridedSlice", "input": ["conv5/conv5_3/required_space_to_batch_paddings/add_2", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_3", "op": "StridedSlice", "input": ["conv5/conv5_3/required_space_to_batch_paddings/add_2", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/crops", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/crops/0", "conv5/conv5_3/required_space_to_batch_paddings/crops/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/paddings/1", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_5"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/paddings/0", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__67", "conv5/conv5_3/required_space_to_batch_paddings/strided_slice_3"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/required_space_to_batch_paddings/paddings", "op": "Pack", "input": ["conv5/conv5_3/required_space_to_batch_paddings/paddings/0", "conv5/conv5_3/required_space_to_batch_paddings/paddings/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv5/conv5_3/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["conv5/conv5_2/Relu", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_3/required_space_to_batch_paddings/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/Conv2D", "op": "Conv2D", "input": ["conv5/conv5_3/SpaceToBatchND", "conv5/conv5_3/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "conv5/conv5_3/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["conv5/conv5_3/Conv2D", "conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__65", "conv5/conv5_3/required_space_to_batch_paddings/crops"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "conv5/conv5_3/BiasAdd", "op": "BiasAdd", "input": ["conv5/conv5_3/BatchToSpaceND", "conv5/conv5_3/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv5/conv5_3/Relu", "op": "Relu", "input": ["conv5/conv5_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["conv5/conv5_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "concat", "op": "ConcatV2", "input": ["max_pooling2d_2/MaxPool", "max_pooling2d_3/MaxPool", "max_pooling2d_4/MaxPool", "concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_2/Shape", "op": "Shape", "input": ["concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "Mean", "op": "Mean", "input": ["concat", "Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "aspp/conv1_1/Conv2D", "op": "Conv2D", "input": ["concat", "aspp/conv1_1/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "aspp/conv1_4/strided_slice_1", "op": "StridedSlice", "input": ["aspp/conv1_2/Shape", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice_1/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["aspp/conv1_2/Shape", "conv5/conv5_1/strided_slice/stack", "conv5/conv5_1/strided_slice/stack_1", "conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_5/Conv2D", "op": "Conv2D", "input": ["Mean", "aspp/conv1_5/kernel"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_1/BiasAdd", "op": "BiasAdd", "input": ["aspp/conv1_1/Conv2D", "aspp/conv1_1/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "ResizeNearestNeighbor/size", "op": "Pack", "input": ["strided_slice", "aspp/conv1_4/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "aspp/conv1_5/BiasAdd", "op": "BiasAdd", "input": ["aspp/conv1_5/Conv2D", "aspp/conv1_5/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "aspp/conv1_1/Relu", "op": "Relu", "input": ["aspp/conv1_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_4/required_space_to_batch_paddings/add", "ResizeNearestNeighbor/size"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_3/required_space_to_batch_paddings/add", "ResizeNearestNeighbor/size"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["aspp/conv1_2/required_space_to_batch_paddings/add", "ResizeNearestNeighbor/size"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_5/Relu", "op": "Relu", "input": ["aspp/conv1_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["aspp/conv1_4/required_space_to_batch_paddings/add_1", "aspp/conv1_4/required_space_to_batch_paddings/strided_slice_1/_10__cf__61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["aspp/conv1_3/required_space_to_batch_paddings/add_1", "aspp/conv1_2/required_space_to_batch_paddings/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["aspp/conv1_2/required_space_to_batch_paddings/add_1", "aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["aspp/conv1_5/Relu", "ResizeNearestNeighbor/size"], "attr": {"align_corners": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["aspp/conv1_4/required_space_to_batch_paddings/strided_slice_1/_10__cf__61", "aspp/conv1_4/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["aspp/conv1_2/required_space_to_batch_paddings/add", "aspp/conv1_3/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53", "aspp/conv1_2/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["aspp/conv1_4/required_space_to_batch_paddings/sub", "aspp/conv1_4/required_space_to_batch_paddings/strided_slice_1/_10__cf__61"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_3/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["aspp/conv1_3/required_space_to_batch_paddings/sub", "aspp/conv1_2/required_space_to_batch_paddings/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_2/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["aspp/conv1_2/required_space_to_batch_paddings/sub", "aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__53"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "aspp/conv1_4/required_space_to_batch_paddings/strided_slice_7", "op": "StridedSlice", 